In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df

                   A         B         C         D
2013-01-01 -0.756563  0.261519 -0.839340  1.603986
2013-01-02 -0.614125  0.583925  0.116586 -0.467410
2013-01-03 -1.020790 -1.248337 -0.598825  0.339556
2013-01-04  0.770569  0.801797  0.058594 -0.494928
2013-01-05  0.672277  0.798674  1.683392  1.197770
2013-01-06 -1.054225 -0.269685 -1.620232 -0.352695

In [6]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.to_numpy()

array([[-0.75656299,  0.2615192 , -0.8393399 ,  1.60398577],
       [-0.61412529,  0.58392466,  0.11658635, -0.46741045],
       [-1.02079012, -1.24833686, -0.59882492,  0.33955627],
       [ 0.77056928,  0.80179681,  0.05859395, -0.49492754],
       [ 0.67227668,  0.79867384,  1.68339195,  1.19776984],
       [-1.05422471, -0.26968543, -1.62023213, -0.35269521]])

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.333810  0.154649 -0.199971  0.304380
std    0.834278  0.797207  1.122421  0.911555
min   -1.054225 -1.248337 -1.620232 -0.494928
25%   -0.954733 -0.136884 -0.779211 -0.438732
50%   -0.685344  0.422722 -0.270115 -0.006569
75%    0.350676  0.744987  0.102088  0.983216
max    0.770569  0.801797  1.683392  1.603986

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.756563   -0.614125   -1.020790    0.770569    0.672277   -1.054225
B    0.261519    0.583925   -1.248337    0.801797    0.798674   -0.269685
C   -0.839340    0.116586   -0.598825    0.058594    1.683392   -1.620232
D    1.603986   -0.467410    0.339556   -0.494928    1.197770   -0.352695

In [15]:
df

                   A         B         C         D
2013-01-01 -0.756563  0.261519 -0.839340  1.603986
2013-01-02 -0.614125  0.583925  0.116586 -0.467410
2013-01-03 -1.020790 -1.248337 -0.598825  0.339556
2013-01-04  0.770569  0.801797  0.058594 -0.494928
2013-01-05  0.672277  0.798674  1.683392  1.197770
2013-01-06 -1.054225 -0.269685 -1.620232 -0.352695

In [19]:
df.sort_index(axis="columns", ascending=False)

                   D         C         B         A
2013-01-01  1.603986 -0.839340  0.261519 -0.756563
2013-01-02 -0.467410  0.116586  0.583925 -0.614125
2013-01-03  0.339556 -0.598825 -1.248337 -1.020790
2013-01-04 -0.494928  0.058594  0.801797  0.770569
2013-01-05  1.197770  1.683392  0.798674  0.672277
2013-01-06 -0.352695 -1.620232 -0.269685 -1.054225

In [22]:
df.sort_index(axis="rows", ascending=False)

                   A         B         C         D
2013-01-06 -1.054225 -0.269685 -1.620232 -0.352695
2013-01-05  0.672277  0.798674  1.683392  1.197770
2013-01-04  0.770569  0.801797  0.058594 -0.494928
2013-01-03 -1.020790 -1.248337 -0.598825  0.339556
2013-01-02 -0.614125  0.583925  0.116586 -0.467410
2013-01-01 -0.756563  0.261519 -0.839340  1.603986

In [23]:
df.sort_index(axis="index", ascending=False)

                   A         B         C         D
2013-01-06 -1.054225 -0.269685 -1.620232 -0.352695
2013-01-05  0.672277  0.798674  1.683392  1.197770
2013-01-04  0.770569  0.801797  0.058594 -0.494928
2013-01-03 -1.020790 -1.248337 -0.598825  0.339556
2013-01-02 -0.614125  0.583925  0.116586 -0.467410
2013-01-01 -0.756563  0.261519 -0.839340  1.603986

In [36]:
df2=df.copy()

In [37]:
df2["B"]=0
df2.iloc[0,1]=1
df2.iloc[1,1]=1

In [38]:
df2

                   A  B         C         D
2013-01-01 -0.756563  1 -0.839340  1.603986
2013-01-02 -0.614125  1  0.116586 -0.467410
2013-01-03 -1.020790  0 -0.598825  0.339556
2013-01-04  0.770569  0  0.058594 -0.494928
2013-01-05  0.672277  0  1.683392  1.197770
2013-01-06 -1.054225  0 -1.620232 -0.352695

In [40]:
df2.sort_values(by=["B","A"], ascending=[False, False])

                   A  B         C         D
2013-01-02 -0.614125  1  0.116586 -0.467410
2013-01-01 -0.756563  1 -0.839340  1.603986
2013-01-04  0.770569  0  0.058594 -0.494928
2013-01-05  0.672277  0  1.683392  1.197770
2013-01-03 -1.020790  0 -0.598825  0.339556
2013-01-06 -1.054225  0 -1.620232 -0.352695

In [41]:
df["A"]

2013-01-01   -0.756563
2013-01-02   -0.614125
2013-01-03   -1.020790
2013-01-04    0.770569
2013-01-05    0.672277
2013-01-06   -1.054225
Freq: D, Name: A, dtype: float64

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.261519       NaN  1.603986
2013-01-02       NaN  0.583925  0.116586       NaN
2013-01-03       NaN       NaN       NaN  0.339556
2013-01-04  0.770569  0.801797  0.058594       NaN
2013-01-05  0.672277  0.798674  1.683392  1.197770
2013-01-06       NaN       NaN       NaN       NaN

In [47]:
df

                   A         B         C         D
2013-01-01 -0.756563  0.261519 -0.839340  1.603986
2013-01-02 -0.614125  0.583925  0.116586 -0.467410
2013-01-03 -1.020790 -1.248337 -0.598825  0.339556
2013-01-04  0.770569  0.801797  0.058594 -0.494928
2013-01-05  0.672277  0.798674  1.683392  1.197770
2013-01-06 -1.054225 -0.269685 -1.620232 -0.352695

In [45]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [49]:
df.sub(s, axis="index")

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -2.020790 -2.248337 -1.598825 -0.660444
2013-01-04 -2.229431 -2.198203 -2.941406 -3.494928
2013-01-05 -4.327723 -4.201326 -3.316608 -3.802230
2013-01-06       NaN       NaN       NaN       NaN

In [68]:
df1=pd.DataFrame(np.ones((4,5)))
df1

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0

In [69]:
df1 = df1.apply(np.cumsum, axis="columns").apply(np.cumsum, axis="index")
df1

     0    1     2     3     4
0  1.0  2.0   3.0   4.0   5.0
1  2.0  4.0   6.0   8.0  10.0
2  3.0  6.0   9.0  12.0  15.0
3  4.0  8.0  12.0  16.0  20.0

In [70]:
df1.apply(lambda x: x.max() - x.min())

0     3.0
1     6.0
2     9.0
3    12.0
4    15.0
dtype: float64